-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1
-- Время создания: Апр 14 2016 г., 13:30
-- Версия сервера: 10.1.10-MariaDB
-- Версия PHP: 5.6.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `routecalculation`
--

-- --------------------------------------------------------

--
-- Структура таблицы `lugansk`
--

CREATE TABLE `lugansk` (
  `id` int(255) NOT NULL,
  `address` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `indexmail` int(100) NOT NULL,
  `address2` text NOT NULL,
  `addressDesc` text NOT NULL,
  `tel` varchar(255) NOT NULL,
  `latlocation` double NOT NULL,
  `lnglocation` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `lugansk`
--

INSERT INTO `lugansk` (`id`, `address`, `name`, `indexmail`, `address2`, `addressDesc`, `tel`, `latlocation`, `lnglocation`) VALUES
(2, 'Луганск', 'Луганск 2', 91002, 'г. Луганск, ул.Артема, 183', 'г. Луганск, ул.Артема, 183', '42-48-68', 48.590532, 39.306782),
(3, 'Луганск', 'Луганск 4', 91004, 'г. Луганск Остаря могила, 151', 'г. Луганск Остаря могила, 151', '42-75-53', 48.526261, 39.364185),
(4, 'Луганск', 'Луганск 5', 91005, 'г. Луганс, ул. Годуванцева, 6', 'г. Луганс, ул. Годуванцева, 6', '49-34-77', 48.572829, 39.338619),
(5, 'Луганск', 'Луганск 6', 91006, 'г. Луганс, ул. Героев Сталинграда, 9а', 'г. Луганс, ул. Героев Сталинграда, 9а', '31-68-07', 48.541367, 39.261759),
(6, 'Луганск', 'Луганск 7', 91007, 'г. Луганс, ул. Достаевского, 43', 'г. Луганс, ул. Достаевского, 43', '64-04-40', 48.546885, 39.288017),
(7, 'Луганск', 'Луганск 8', 91008, 'г. Луганс, ул. ЛГАУ (Аграрный университет)', 'г. Луганс, ул. ЛГАУ (Аграрный университет)', '96-73-58', 48.559045, 39.253674),
(8, 'Луганск', 'Луганск 11', 91011, 'г. Луганск, ул. Оборонная, 5', 'г. Луганск, ул. Оборонная, 5', '55-31-67', 48.562604, 39.315505),
(9, 'Луганск', 'Луганск 12', 91012, 'г. Луганск, ул. Металистов, 29', 'г. Луганск, ул. Металистов, 29', '42-33-11', 48.587099, 39.321991),
(10, 'Луганск', 'Луганск 14', 91014, 'г. Луганск, ул. Смирнова, 38', 'г. Луганск, ул. Смирнова, 38', '42-25-40', 48.602032, 39.303782),
(11, 'Луганск', 'Луганск 15', 91015, 'г. Луганск, кв. Заречный, 12', 'г. Луганск, кв. Заречный, 12', '32-10-31', 48.528857, 39.269107),
(12, 'Луганск', 'Луганск 16', 91016, 'г. Луганс, ул. 15-я линия, 21', 'г. Луганс, ул. 15-я линия, 21', '58-03-68', 48.570075, 39.311184),
(13, 'Луганск', 'Луганск 19', 91019, 'г. Луганс, ул. Артема, 449', 'г. Луганс, ул. Артема, 449', '92-43-75', 48.580751, 39.276563),
(14, 'Луганск', 'Луганск 20', 91020, 'г. Луганск пер. Крымский, 1', 'г. Луганск пер. Крымский, 1', '55-59-16', 48.52471, 39.311463),
(15, 'Луганск', 'Луганск 21', 91021, 'г. Луганс, кв. Гаевого, 35', 'г. Луганс, кв. Гаевого, 35', '65-49-68', 48.560088, 39.262711),
(16, 'Луганск', 'Луганск 24', 91024, 'г. Луганск, ул. Ленинградская, 11', 'г. Луганск, ул. Ленинградская, 11', '64-58-76', 48.586723, 39.375881),
(17, 'Луганск', 'Луганск 25', 91025, 'г. Луганс, ул. Ульянова, 38а', 'г. Луганс, ул. Ульянова, 38а', '93-82-06', 48.610336, 39.38269),
(18, 'Луганск', 'Луганск 26', 91026, 'г. Луганс, ул. Амурская, 2а', 'г. Луганс, ул. Амурская, 2а', '93-83-98', 48.661433, 39.403324),
(19, 'Луганск', 'Луганск 28', 91028, 'г. Луганс, ул. Успенского, 66а', 'г. Луганс, ул. Успенского, 66а', '55-54-75', 48.505419, 39.296053),
(20, 'Луганск', 'Луганск 29', 91029, 'г. Луганс, кв. Луганский, 13а', 'г. Луганс, кв. Луганский, 13а', '65-94-61', 48.539858, 39.274254),
(21, 'Луганск', 'Луганск 31', 91031, 'г. Луганск, кв. Героев Брестской Крепости, 9', 'г. Луганск, кв. Героев Брестской Крепости, 9', '61-52-79', 48.556427, 39.328144),
(22, 'Луганск', 'Луганск 33', 91033, 'г. Луганск, кв. Шевченко, 12', 'г. Луганск, кв. Шевченко, 12', '63-83-50', 48.552837, 39.331944),
(23, 'Луганск', 'Луганск 34', 91034, 'г. Луганс, кв. Молодежный, 6', 'г. Луганс, кв. Молодежный, 6', '63-34-64', 48.570945, 39.37483),
(24, 'Луганск', 'Луганск 38', 91038, 'г. Луганс, ул. Строительная, 19', 'г. Луганс, ул. Строительная, 19', '93-41-71', 48.53879, 39.30822),
(25, 'Луганск', 'Луганск 42', 91042, 'г. Луганс, кв. 50 лет Октября, 27', 'г. Луганс, кв. 50 лет Октября, 27', '62-87-27', 48.57305, 39.397377),
(26, 'Луганск', 'Луганск 43', 91043, 'г. Луганск, ул. Северная, 31', 'г. Луганск, ул. Северная, 31', '42-12-10', 48.598385, 39.337217),
(27, 'Луганск', 'Луганск 45', 91045, 'г. Луганск, кв. 50 лет Обороны Луганска, 1', 'г. Луганск, кв. 50 лет Обороны Луганска, 1', '63-97-14', 48.513198, 39.358795),
(28, 'Луганск', 'Луганск 47', 91047, 'г. Луганск, ул. Ладыгина, 4а', 'г. Луганск, ул. Строительная, 19', '42-79-67', 48.530778, 39.349551),
(29, 'Луганск', 'Луганск 48', 91048, 'г. Луганск, ул. Волгоградская, 60б', 'г. Луганск, ул. Волгоградская, 60б', '61-25-88', 48.551745, 39.353396),
(30, 'Луганск', 'Луганск 49', 91049, 'г. Луганск, ул. Северодонецкая, 1', 'г. Луганс, ул. Северодонецкая, 1', '93-84-78', 48.638856, 39.406415),
(31, 'Луганск', 'Луганск 50', 91050, 'г. Луганск, кв. Комарова, 11', 'г. Луганск, кв. Комарова, 11', '47-60-19', 48.561072, 39.388511),
(32, 'Луганск', 'Луганск 54', 91054, 'г. Луганск, ул. Суходольская, 6', 'г. Луганск, ул. Суходольская, 6', '64-40-60', 48.586157, 39.397306),
(33, 'Луганск', 'Луганск 55', 91055, 'г. Луганск, ул. Титова, 9', 'г. Луганск, ул. Титова, 9', '53-00-93', 48.574165, 39.306603),
(34, 'Луганск', 'Луганск 56', 91056, 'г. Луганс, ул. В. Пятеркина, 8', 'г. Луганс, ул. В. Пятеркина, 8', '93-70-76', 48.56998, 39.28428),
(35, 'Луганск', 'Луганск 57', 91057, 'г.Луганс, кв. Волкова, 2а', 'г.Луганс, кв. Волкова, 2а', '47-60-35', 48.567094, 39.396623),
(36, 'Луганск', 'Александровск', 91484, 'Луганская область, г. Александровск, ул. Красная Площадь, 10', 'г. Александровск, ул. Красная Площадь, 10', '91-13-82', 48.586777, 39.187657),
(37, 'Луганск', 'Юбилейный', 91493, 'Луганская область, Юбилейный, ул. Артема, 3', 'Луганская область, Юбилейный, ул. Артема, 3', '93-60-52', 48.55793, 39.187145);

-- --------------------------------------------------------

--
-- Структура таблицы `route`
--

CREATE TABLE `route` (
  `id` int(255) NOT NULL,
  `indexmail` int(255) NOT NULL,
  `latlocation` double NOT NULL,
  `lnglocation` double NOT NULL,
  `name` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `lugansk`
--
ALTER TABLE `lugansk`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `route`
--
ALTER TABLE `route`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `lugansk`
--
ALTER TABLE `lugansk`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
--
-- AUTO_INCREMENT для таблицы `route`
--
ALTER TABLE `route`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
